sunyongzhen/CHULIAN_GIT/GD32F30x_Demo_Suites_V2.4.3_release/GD32307C_EVAL_Demo_Suites/Project/25_CHULIAN_0314/Projects/FreeRTOS_tcpudp/src/app_rs485net.c
#include "lwip/opt.h"
#include "lwip/tcp.h"
#include "lwip/sys.h"
#include "gd32f30x.h"
#include "gd32f307c_eval.h"
#include "lwip/api.h"
#include "protocol_modbus.h"
#include "protocol_usart.h"
#include "app_rs485net.h"
#include "module_display.h"
#include "app_configure.h"
#include "app_format.h"
#include "module_audio.h"
#include "module_led.h"
#include "module_key.h"
#include "module_adc.h"
#include <string.h>

#define RS485NET_TASK_PRIO  ( tskIDLE_PRIORITY + 5 )

extern struct eeprom_data *p_configuration_data;

struct rs485net_timing_t
{
    uint32_t bus;
    uint16_t frequency;
    uint16_t address;
} deviceList[4];

#if 0
void scan_dev(uint32_t usart_periph)
{
    unsigned char dev = 0;
    unsigned char rdata[8] = {0};
    int retry = 0;

    for (dev = 0; dev < 0xff; dev++)
    {
        while (usart_send(usart_periph, (uint8_t *)packed_modbus_rtu_frame(dev, 0x03, 0x0000, 0x0001), 8) < 0)
        {
            retry++;
            if (retry > 100)
            {
                retry = 0;
//                printf("usart_send retry over 100 times \r\n");
                break;
            }
        }
        while (usart_recv_pre(usart_periph, 7) < 0)
        {
            retry++;
            if (retry > 100)
            {
                retry = 0;
//                printf("usart_recv_pre retry over 100 times \r\n");
                break;
            }
        }
        while (usart_recv(usart_periph, rdata) < 0)
        {
            retry++;
            if (retry > 100)
            {
                retry = 0;
//                printf("usart_recv retry over 100 times \r\n");
                break;
            }
        }
    }
}
#endif

int led_status = 0;
int audio_num = 0;

void cancel_alarm()
{	
	led_status &= 0xdf;
	led_process_cmd(0, &led_status, 1);
	audio_process_cmd(0, 0, 0);
	audio_process_cmd(5, 0, 0);
}

void alarm_action(uint8_t n)
{
	//报警灯
	led_status |= 0x30;
//	printf("led status %d\r\n", led_status);
	led_process_cmd(0, &led_status, 1);
	 vTaskDelay(pdMS_TO_TICKS(300));
	//蜂鸣器
	audio_process_cmd(4, 0, 0);
	//语音播放
	set_num(n);  //动火离人预警
	audio_process_cmd(1, 0, 0);
}

void set_alarm_data()
{
	alarmdata_report.data_type = 1;
	alarmdata_report.alarm_type.time_stamp = rtc_counter_get();
	alarmdata_report.alarm_param.time_stamp = alarmdata_report.alarm_type.time_stamp;
}

void set_warn_data()
{
	warndata_report.data_type = 1;
	warndata_report.alarm_type.time_stamp = rtc_counter_get();
	warndata_report.alarm_param.time_stamp = warndata_report.alarm_type.time_stamp;
}

static void rs485net_task(void *arg)
{
    uint32_t count = 0;
    uint32_t ltimestamp = 0, temp_warn_time = 0, temp_alarm_time = 0, left_ltimestamp = 0;
	uint32_t dhlr_warn_time = 0, dhlr_alarm_time = 0, gas_alarm_time = 0, smoke_alarm_time = 0;
    uint8_t index = 0;
    uint16_t retry = 0;
    unsigned char rdata[8] = {0};
    char display_buf[7];
    int key_status = 0;
	int adc_value[4] = {0};  //add by heyt 20240304
	
	uint8_t smoke_alarm_status = 0, gas_alarm_status = 0;
	uint8_t temp_warn_status = 0, temp_alarm_status = 0;
	uint8_t dhlr_warn_status = 0, dhlr_alarm_status = 0;
	uint8_t lr_status = 0, adc_status = 0;
	uint32_t smoke_alarm_ltimestamp = 0, gas_alarm_ltimestamp = 0;
	uint32_t temp_warn_ltimestamp = 0, temp_alarm_ltimestamp = 0;
	uint32_t dhlr_warn_ltimestamp = 0, dhlr_alarm_ltimestamp = 0;
	
	
    memcpy(heartbeat_reportdata.heart_data.serial_number.value, "72-0066DF313436-3331", 21);
    ltimestamp = rtc_counter_get();
    while (1)
    {
        // get key status
        key_status = get_key_value();
        printf("keybitmap:%02x\r\n", key_status);
        if ((key_status & 0x01) == 0)
        {	
			cancel_alarm();
			//add by heyt 20240306 start ----------------------
			smoke_alarm_status = 0;
			gas_alarm_status = 0;
			temp_warn_status = 0;
			temp_alarm_status = 0;
			dhlr_warn_status = 0;
			dhlr_alarm_status = 0;
			lr_status = 0;
			adc_status = 0;
			//add by heyt 20240306 end ------------------------
        }
        
        memset(rdata, 0x00, 8);

        heartbeat_reportdata.heart_data.serial_number.time_stamp = rtc_counter_get();
//        printf("timestamp: %d\r\n", heartbeat_reportdata.heart_data.serial_number.time_stamp);
        for (index = 0; index < 4; index++)
        {
            if ((count % deviceList[index].frequency) == 0)
            {
                while (usart_send(deviceList[index].bus, (uint8_t *)packed_modbus_rtu_frame(deviceList[index].address, 0x03, 0x0000, 0x0001), 8) < 0)
                {
//                    retry++;
//                    vTaskDelay(pdMS_TO_TICKS(10));
//                    if (retry > 100)
//                    {
//                        retry = 0;
//                        printf("usart_send retry over 100 times \r\n");
//                        break;
//                    }
                }

                // delay 1ms to make sure send finish
                vTaskDelay(pdMS_TO_TICKS(1));

                usart_recv_clear(deviceList[index].bus);
                while (usart_recv_pre(deviceList[index].bus, 7) < 0)
                {
                    retry++;
                    vTaskDelay(pdMS_TO_TICKS(10));
                    if (retry > 100)
                    {
                        retry = 0;
                        printf("usart_recv_pre retry over 100 times \r\n");
                        break;
                    }
                }

                while (usart_recv(deviceList[index].bus, rdata) < 0)
                {
                    retry++;
                    vTaskDelay(pdMS_TO_TICKS(10));
                    if (retry > 100)
                    {
                        printf("usart_recv %d retry over 100 times \r\n", index);
                        break;
                    }
                }
                if (retry > 100)
                {
                    retry = 0;
                }
                else
                {
                    if (parse_modbus_rtu_frame((ModbusRtuFrameAck *)rdata) == 0)
                    {
                        led_status |= 0x08;
                        led_process_cmd(0, &led_status,1);
//                        printf("slave_address:%02x, function_code:%02x, byte_count:%02x, ", ((ModbusRtuFrameAck *)rdata)->slave_address, ((ModbusRtuFrameAck *)rdata)->function_code, ((ModbusRtuFrameAck *)rdata)->byte_count);
//                        printf("data[0]:%02x, data[1]:%02x\r\n", ((ModbusRtuFrameAck *)rdata)->data[0], ((ModbusRtuFrameAck *)rdata)->data[1]);
						
