sunyongzhen/CHULIAN_GIT/GD32F30x_Demo_Suites_V2.4.3_release/GD32307C_EVAL_Demo_Suites/Project/25_CHULIAN_0314/Projects/FreeRTOS_tcpudp/src/app_rs485net.c
                        switch (((ModbusRtuFrameAck *)rdata)->slave_address >> 6)
                        {
                        case 0x00: // smoker
                            sprintf(display_buf, "%02d.%02d", ((ModbusRtuFrameAck *)rdata)->data[0] % 100, ((ModbusRtuFrameAck *)rdata)->data[1] % 100);
                            // TODO:display smoker value
                            lcd_display(4, 5, display_buf);

                            // TODO: upload smoker sensor's value
                            heartbeat_reportdata.heart_data.smoke_detector.time_stamp = rtc_counter_get();
                            sprintf(heartbeat_reportdata.heart_data.smoke_detector.sensors[0].device_id, "%d", ((ModbusRtuFrameAck *)rdata)->slave_address);
                            heartbeat_reportdata.heart_data.smoke_detector.sensors[0].param = ((ModbusRtuFrameAck *)rdata)->data[0] * 100 + ((ModbusRtuFrameAck *)rdata)->data[1];

                            // TODO: compare with alram th
                            printf("smoker value: %d\r\n", heartbeat_reportdata.heart_data.smoke_detector.sensors[0].param);
							
                            if ((key_status&0x01) && (heartbeat_reportdata.heart_data.smoke_detector.sensors[0].param > 40))//p_configuration_data->smoke_threshold))
                            {
								if(smoke_alarm_status == 0 && dhlr_alarm_status == 0 && gas_alarm_status == 0)
								{
									printf("smoke alarm status = 1\r\n");
									smoke_alarm_status = 1;
									smoke_alarm_ltimestamp = rtc_counter_get();
									temp_alarm_status = 0;
									temp_warn_status = 0;
									dhlr_warn_status = 0;
								}
                            }else{
								smoke_alarm_status = 0;
								smoke_alarm_ltimestamp = 0;
								smoke_alarm_time = 0;
							}
                            break;
							
                        case 0x01: // gas
                            sprintf(display_buf, "%02d.%02d", ((ModbusRtuFrameAck *)rdata)->data[0] % 100, ((ModbusRtuFrameAck *)rdata)->data[1] % 100);
                            // TODO:display gas value
                            lcd_display(3, 5, display_buf);
                            // TODO: compare with alram th
                            // TODO: upload smoker sensor's value
                            heartbeat_reportdata.heart_data.gas_detector.time_stamp = rtc_counter_get();
                            sprintf(heartbeat_reportdata.heart_data.gas_detector.sensors[0].device_id, "%d", ((ModbusRtuFrameAck *)rdata)->slave_address);
                            heartbeat_reportdata.heart_data.gas_detector.sensors[0].param = ((ModbusRtuFrameAck *)rdata)->data[0] * 100 + ((ModbusRtuFrameAck *)rdata)->data[1];
							printf("gas value %d\r\n",  heartbeat_reportdata.heart_data.gas_detector.sensors[0].param);
						
							if ((key_status&0x01) && (heartbeat_reportdata.heart_data.gas_detector.sensors[0].param > 80))//p_configuration_data->gas_threshold))
                            {
								if(gas_alarm_status == 0 && dhlr_alarm_status == 0)
								{
									printf("gas alarm status = 1\r\n");
									gas_alarm_status = 1;
									gas_alarm_ltimestamp = rtc_counter_get();
									smoke_alarm_status = 0;
									temp_alarm_status = 0;
									temp_warn_status = 0;
									dhlr_warn_status = 0;
								}
                            }
							else{
								gas_alarm_status = 0;
								gas_alarm_ltimestamp = 0;
								gas_alarm_time = 0;
							}
                            break;
							
                        case 0x02: // tempeture
                            heartbeat_reportdata.heart_data.temperature.sensors[0].param = ((ModbusRtuFrameAck *)rdata)->data[0] << 8 | ((ModbusRtuFrameAck *)rdata)->data[1];
                            
                            sprintf(display_buf, " %03d.%d", (heartbeat_reportdata.heart_data.temperature.sensors[0].param / 10) % 1000, heartbeat_reportdata.heart_data.temperature.sensors[0].param % 10);
                            // TODO:display tempeture value
                            lcd_display(2, 4, display_buf);

                            // TODO: upload tempeture sensor's value
                            heartbeat_reportdata.heart_data.temperature.time_stamp = rtc_counter_get();
                            sprintf(heartbeat_reportdata.heart_data.temperature.sensors[0].device_id, "%d", ((ModbusRtuFrameAck *)rdata)->slave_address);
                            // TODO: compare with alram th
                        	printf("temperature  %d \r\n", heartbeat_reportdata.heart_data.temperature.sensors[0].param);
							// edit by heyt 20240305 start ------------
							//温度大于报警温度 不管有无人 报警
							if ((key_status&0x01) && ((heartbeat_reportdata.heart_data.temperature.sensors[0].param / 10) > 200))//(p_configuration_data->alarm_temp - p_configuration_data->temp_calibrate)))
                            {
								if(temp_alarm_status == 0 && dhlr_alarm_status == 0 && gas_alarm_status == 0 && smoke_alarm_status == 0)
								{
									printf("tempeture alarm status = 1\r\n");
									temp_alarm_status = 1;
									temp_alarm_ltimestamp = rtc_counter_get();
									dhlr_warn_status = 0;
									temp_warn_status = 0;
								}
                            }
							else if((key_status&0x01) && ((heartbeat_reportdata.heart_data.temperature.sensors[0].param / 10) > 100))//(p_configuration_data->warn_temp - p_configuration_data->temp_calibrate)))
                            {
								
								if(temp_warn_status == 0 && temp_alarm_status == 0 && dhlr_alarm_status == 0 
									&& gas_alarm_status == 0 && smoke_alarm_status == 0 && dhlr_warn_status == 0)
								{
									printf("tempeture warn status = 1\r\n");
									temp_warn_status = 1;
									temp_warn_ltimestamp = rtc_counter_get();
								}
                            }
							else{
								temp_warn_status = 0;
								temp_warn_ltimestamp = 0;
								temp_warn_time = 0;
								temp_alarm_status = 0;
								temp_alarm_ltimestamp = 0;
								temp_alarm_time = 0;
							}
							break;
							// edit by heyt 20240305 end ------------
                        case 0x03: // pir
                            // TODO:display pir value
                            if (((ModbusRtuFrameAck *)rdata)->data[1] == 1)
                            { // 有人，清空离人时间
                                heartbeat_reportdata.heart_data.body_detector.leave_time_stamp = 0;
                                heartbeat_reportdata.heart_data.body_detector.status = ((ModbusRtuFrameAck *)rdata)->data[1];
                                sprintf(display_buf, " 000");
                                lcd_display(1, 5, display_buf);
								lr_status = 0;
                            }
                            else
                            { // 没人，且上次也没人
                                if (heartbeat_reportdata.heart_data.body_detector.status == ((ModbusRtuFrameAck *)rdata)->data[1])
                                {
                                    heartbeat_reportdata.heart_data.body_detector.leave_time_stamp = heartbeat_reportdata.heart_data.body_detector.time_stamp - left_ltimestamp;
                                }
                                else // 没人，上次有人
                                {	
                                    // person left detected, save timestamp
                                    left_ltimestamp = rtc_counter_get();
                                }
								lr_status = 1;
                                heartbeat_reportdata.heart_data.body_detector.status = ((ModbusRtuFrameAck *)rdata)->data[1];
                                heartbeat_reportdata.heart_data.body_detector.time_stamp = rtc_counter_get();
                            }
							// 显示时间
                            if ((heartbeat_reportdata.heart_data.body_detector.leave_time_stamp > 0) && (heartbeat_reportdata.heart_data.body_detector.leave_time_stamp < 1000))
                            {
                                sprintf(display_buf, " %03d", heartbeat_reportdata.heart_data.body_detector.leave_time_stamp);
                                lcd_display(1, 5, display_buf);
								printf("left time %d\r\n", heartbeat_reportdata.heart_data.body_detector.leave_time_stamp);
//                                if ((key_status & 0x01) && (heartbeat_reportdata.heart_data.body_detector.leave_time_stamp > (p_configuration_data->warn_time + p_configuration_data->alarm_time)))
//                                {
//                                    audio_process_cmd(4, 0, 0);
//                                    led_status |= 0x20;
//                                    led_process_cmd(0, &led_status,0);
//                                }
                            }
                            // TODO: compare with alram th
                            // TODO: upload smoker sensor's value
                            break;
                        default:
                            break;
                        }

