sunyongzhen/CHULIAN_GIT/GD32F30x_Demo_Suites_V2.4.3_release/GD32307C_EVAL_Demo_Suites/Project/25_CHULIAN_0314/Projects/FreeRTOS_tcpudp/src/app_rs485net.c
                    }
                }
//                printf("%02x %02x %02x %02x %02x %02x %02x %02x\r\n", rdata[0], rdata[1], rdata[2], rdata[3], rdata[4], rdata[5], rdata[6], rdata[7]);
            }
            vTaskDelay(pdMS_TO_TICKS(100));
        }
        count++;
		// TODO:ADC read
		// 取adc 电流最大值
		adc_process_cmd(0, adc_value, 4);
		heartbeat_reportdata.heart_data.fire_sampler.code_data = 0;
		for(index = 0; index < 4; index++){
			if(adc_value[index] > heartbeat_reportdata.heart_data.fire_sampler.code_data){
				heartbeat_reportdata.heart_data.fire_sampler.code_data = adc_value[index];
			}
		}
		heartbeat_reportdata.heart_data.fire_sampler.code_data = 100;   //---------------
		if(heartbeat_reportdata.heart_data.fire_sampler.code_data > 2000){//p_configuration_data->hot_work_threshold){
			adc_status = 1;
		}else{
			adc_status = 0;
		}
		
		/*    判断动火状态    */
		//动火报警
		if((key_status & 0x01) && (lr_status == 1) && (temp_alarm_status == 1 || adc_status == 1))
		{
			if(dhlr_alarm_status == 0){
				printf("dhlr alarm status = 1\r\n");
				dhlr_alarm_status = 1;
				dhlr_alarm_ltimestamp = rtc_counter_get();
				gas_alarm_status = 0;
				smoke_alarm_status = 0;
				temp_alarm_status = 0;
				dhlr_warn_status = 0;
				temp_warn_status = 0;
			}
		}
		//动火预警
		else if((key_status & 0x01) && (lr_status == 1) && (temp_warn_status == 1 || adc_status == 1))
		{
			if(dhlr_warn_status == 0 && dhlr_alarm_status == 0 && smoke_alarm_status == 0 
				&& gas_alarm_status == 0 && temp_alarm_status == 0){
					
				printf("dhlr warn status = 1\r\n");
				dhlr_warn_status = 1;
				dhlr_warn_ltimestamp = rtc_counter_get();
				temp_warn_status = 0;
			}
		}
		//没有动火
		else if(!(key_status & 0x01) || (lr_status == 0) || 
			(temp_alarm_status == 0 && temp_warn_status == 0 && adc_status == 0))
		{
			printf("dhlr status = 0\r\n");
			dhlr_warn_status = 0;
			dhlr_warn_ltimestamp = 0;
			dhlr_warn_time = 0;
			dhlr_alarm_status = 0;
			dhlr_alarm_ltimestamp = 0;
			dhlr_alarm_time = 0;
		}
		
		
		//动火预警
		if(dhlr_warn_status == 1 && dhlr_alarm_status == 0 && gas_alarm_status == 0
			&& smoke_alarm_status == 0 && temp_alarm_status == 0)
		{
			ltimestamp = rtc_counter_get();
			if(dhlr_warn_time == 0)//无动火预警行为
			{		//时间大于预警延迟
				if((ltimestamp - dhlr_warn_ltimestamp) > 5)//p_configuration_data->warn_delay)
				{	
					printf("dhlr warn > delay action\r\n");
					//预警
					set_warn_data();
					sprintf(alarmdata_report.alarm_type.value, "%s", "DHLR_WARN");
					if(temp_warn_status == 1){
						sprintf(warndata_report.alarm_param.value, "0.%d", heartbeat_reportdata.heart_data.temperature.sensors[0].param / 100);
					}else if(adc_status == 1){
						sprintf(warndata_report.alarm_param.value, "0.%d", heartbeat_reportdata.heart_data.fire_sampler.code_data);
					}
					alarm_action(0);
					//记录预警时间
					dhlr_warn_time = rtc_counter_get();
				}
			}
			else  //有动火预警行为
			{
				ltimestamp = rtc_counter_get(); 
				// 动火预警时间 大于 预警时长 取消预警
				if(ltimestamp - dhlr_warn_time > 5)//p_configuration_data->warn_time)
				{  
					printf("dhlr warn cancel action\r\n");
					cancel_alarm();
				}
				// 动火时间 大于 报警延迟 报警
				if(ltimestamp - dhlr_warn_time > 10)//p_configuration_data->alarm_delay)
				{
					printf("dhlr warn -> alarm action\r\n");
					// 报警
					set_alarm_data();
					sprintf(alarmdata_report.alarm_type.value, "%s", "DHLR_ALARM");
					if(temp_alarm_status == 1){
						sprintf(alarmdata_report.alarm_param.value, "0.%d", heartbeat_reportdata.heart_data.temperature.sensors[0].param / 100);
					}else if(adc_status == 1){
						sprintf(alarmdata_report.alarm_param.value, "0.%d", heartbeat_reportdata.heart_data.fire_sampler.code_data);
					}
					alarm_action(1);
					//退出预警状态
					dhlr_warn_status = 0;
					dhlr_warn_time = 0;
					//进入报警状态
					dhlr_alarm_status = 1;
					dhlr_alarm_time = rtc_counter_get();
				}
			}
		}
		//优先级最高  顺序为 : 动火离人报警 > 燃气报警 > 烟雾报警 > 高温报警 > 动火离人预警 > 高温预警
		if(dhlr_alarm_status == 1) // 动火报警
		{
			ltimestamp = rtc_counter_get();
			if(dhlr_alarm_time == 0) //没有报警行为
			{  //动火时间 大于 报警延迟
				if(ltimestamp - dhlr_alarm_ltimestamp > 10)//p_configuration_data->alarm_delay)
				{	
					printf("dhlr alarm action start \r\n");
					//报警
					set_alarm_data();
					sprintf(alarmdata_report.alarm_type.value, "%s", "DHLR_ALARM");
					if(temp_alarm_status == 1){
						sprintf(alarmdata_report.alarm_param.value, "0.%d", heartbeat_reportdata.heart_data.temperature.sensors[0].param / 100);
					}else if(adc_status == 1){
						sprintf(alarmdata_report.alarm_param.value, "0.%d", heartbeat_reportdata.heart_data.fire_sampler.code_data);
					}
					alarm_action(1);
					//记录报警时间
					dhlr_alarm_time = rtc_counter_get();
				}
			}
			else
			{	// 动火报警时间大于报警时长
				if(ltimestamp - dhlr_alarm_time > 10)//p_configuration_data->alarm_time)
				{
					printf("dhlr alarm cancel \r\n");
					cancel_alarm(); //取消报警
					key_process_cmd(0, 0, 0); //断电断气
					dhlr_alarm_status = 0;
					dhlr_alarm_time = 0;
					dhlr_warn_status = 0;
					dhlr_warn_time = 0;
					temp_alarm_status = 0;
				}
			}
		}
		
		/* 燃气 报警 */
		if(gas_alarm_status == 1 && dhlr_alarm_status == 0)
		{
			ltimestamp = rtc_counter_get();
			if(gas_alarm_time == 0)  //没有报警行为
			{
				//报警时间大于报警延迟
				if(ltimestamp - gas_alarm_ltimestamp > 10)//p_configuration_data->alarm_delay)
				{
					printf("gas alarm action\r\n");
					set_alarm_data();
					sprintf(alarmdata_report.alarm_type.value, "%s", "GAS_ALARM");
					sprintf(alarmdata_report.alarm_param.value, "0.%d", heartbeat_reportdata.heart_data.gas_detector.sensors[0].param / 100);
					alarm_action(4);
					gas_alarm_time = rtc_counter_get();
				}
			}
			else
			{	//报警时间大于报警时长
				if(ltimestamp - gas_alarm_time > 10)//p_configuration_data->alarm_time)
				{
					printf("cancel gas alarm action\r\n");
					cancel_alarm();
					key_process_cmd(0, 0, 0); //断电断气
					gas_alarm_status = 0;
					gas_alarm_time = 0;
				}
			}
		}
		
		/* 烟雾报警 */
		if(smoke_alarm_status == 1 && dhlr_alarm_status == 0 && gas_alarm_status == 0)
		{
			ltimestamp = rtc_counter_get();
			if(smoke_alarm_time == 0)  //没有报警行为
			{
				//报警时间大于报警延迟
				if(ltimestamp - smoke_alarm_ltimestamp > 10)//p_configuration_data->alarm_delay)
				{
					printf("smoke alarm action\r\n");
					set_alarm_data();
					sprintf(alarmdata_report.alarm_type.value, "%s", "SMOKE_ALARM");
					sprintf(alarmdata_report.alarm_param.value, "0.%d", heartbeat_reportdata.heart_data.smoke_detector.sensors[0].param / 100);
					alarm_action(5);
					smoke_alarm_time = rtc_counter_get();
				}
			}
			else
			{	//报警时间大于报警时长
				if(ltimestamp - smoke_alarm_time > 10)//p_configuration_data->alarm_time)
				{
					printf("cancel smoke alarm action\r\n");
					cancel_alarm();
					key_process_cmd(0, 0, 0);//断电断气
					smoke_alarm_status = 0;
					smoke_alarm_time = 0;
				}
			}
		}
		
		/* 高温预警 */
		if(temp_warn_status == 1 && dhlr_alarm_status == 0 && gas_alarm_status == 0 && smoke_alarm_status == 0
			&& temp_alarm_status == 0 && dhlr_warn_status == 0)
		{
			ltimestamp = rtc_counter_get();
			if(temp_warn_time == 0) // 没有温度预警行为
			{	//温度预警时间大于预警延迟 
				if(ltimestamp - temp_warn_ltimestamp > 5)//p_configuration_data->warn_delay)
				{  
					printf("temp warn > delay \r\n");
					//预警
					set_warn_data();
					sprintf(warndata_report.alarm_type.value, "%s", "OIL_TEMP_WARN");
					sprintf(warndata_report.alarm_param.value, "0.%d", heartbeat_reportdata.heart_data.temperature.sensors[0].param / 100);
					alarm_action(2);
					temp_warn_time = rtc_counter_get();
				}
			}
			else // 有温度预警行为
			{	//温度预警时间大于预警时长
				if(ltimestamp - temp_warn_time > 5)//p_configuration_data->warn_time)
				{
					printf("cancel temp warn \r\n");
					cancel_alarm();
				}
				//温度预警时间大于报警延迟
				if(ltimestamp - temp_warn_time > 10)//p_configuration_data->alarm_delay)
				{	
					printf("temp warn -> alarm action \r\n");
					//报警
					set_alarm_data();
					sprintf(alarmdata_report.alarm_type.value, "%s", "DHLR_OIL_TEMP_HIGH");
					sprintf(alarmdata_report.alarm_param.value, "0.%d", heartbeat_reportdata.heart_data.temperature.sensors[0].param / 100);
					alarm_action(3);
					//退出预警状态
					temp_warn_status = 0;
					temp_warn_time = 0;
					//进入报警状态
					temp_alarm_status = 1;
					temp_alarm_time = rtc_counter_get();
				}
			}
		}	
		
