sunyongzhen/CHULIAN_GIT/GD32F30x_Demo_Suites_V2.4.3_release/GD32307C_EVAL_Demo_Suites/Project/25_CHULIAN_0314/Projects/FreeRTOS_tcpudp/src/app_rs485net.c
		/* 高温报警 */
		if(temp_alarm_status == 1 && dhlr_alarm_status == 0 && gas_alarm_status == 0 && smoke_alarm_status == 0)
		{
			ltimestamp = rtc_counter_get();
			if(temp_alarm_time == 0) //无报警行为
			{	//高温报警时间大于报警延迟
				if(ltimestamp - temp_alarm_ltimestamp > 10)//p_configuration_data->alarm_delay)
				{
					printf("temp alarm action start \r\n");
					set_alarm_data();
					sprintf(alarmdata_report.alarm_type.value, "%s", "DHLR_OIL_TEMP_HIGH");
					sprintf(alarmdata_report.alarm_param.value, "0.%d", heartbeat_reportdata.heart_data.temperature.sensors[0].param / 100);
					alarm_action(3);
					temp_alarm_time = rtc_counter_get();
				}
			}
			else
			{
				if(ltimestamp - temp_alarm_time > 10)//p_configuration_data->alarm_time)
				{
					printf("cancel temp alarm action\r\n");
					cancel_alarm();
					key_process_cmd(0, 0, 0);
					temp_alarm_status = 0;
					temp_alarm_time = 0;
				}
			}
		}
		
		
	
		vTaskDelay(pdMS_TO_TICKS(100));
		//add by heyt 20240306 end ----------------------
		
//        // TODO: 电池阀状态 相关应用
//        heartbeat_reportdata.heart_data.power_valves.time_stamp = rtc_counter_get();
//        heartbeat_reportdata.heart_data.power_valves.status = 0;
//        // TODO: 动火传感器码值处理
//        heartbeat_reportdata.heart_data.fire_sampler.time_stamp = rtc_counter_get();
//        heartbeat_reportdata.heart_data.fire_sampler.code_data = 800;
    }
}

void rs485net_task_init(void)
{
    deviceList[0].bus = EVAL_COM4;
    deviceList[0].address = 0x0041;
    deviceList[0].frequency = 0x01;
    deviceList[1].bus = EVAL_COM4;
    deviceList[1].address = 0x00c3;
    deviceList[1].frequency = 0x01;
    deviceList[2].bus = EVAL_COM4;
    deviceList[2].address = 0x0000;
    deviceList[2].frequency = 0x01;
    deviceList[3].bus = EVAL_COM4;
    deviceList[3].address = 0x0082;
    deviceList[3].frequency = 0x01;
    xTaskCreate(rs485net_task, "RS485NET", DEFAULT_THREAD_STACKSIZE * 4, NULL, RS485NET_TASK_PRIO, NULL);
}
